* Experimenting with getting Rails running on Docker

Work in progress.

* Running Things

  The Docker[2] containers are boot-strapped with Vagrant[1].  Start them in
  the usual way:

  #+BEGIN_SRC sh
  vagrant up
  #+END_SRC

** Port Forwarding

   Currently Vagrant will warn you that any ports you need forwarded
   will not ne on the docker host VM[3] (if you're using one).  So,
   you'll need to set those yourself.  I set up forwarding for the
   Rails development server by overriding the default boot2docker VM
   configuration and adding my port-forwards there.  See
   [[./docker/Vagrantfile][docker/Vagrantfile]]

   Note also that the boot2docker[4] image runs in RAM and therefore
   doesn't persist its filesystem across reboots.  Switch to another
   docker host OS if this bothers you.

** Connecting to the docker host

   On hosts that don't support Docker natively, Vagrant will
   automatically set up a boot2docker VM for you.  If you want to
   connect to this host for some reason, first you need to get its
   Vagrant ID:

   #+BEGIN_SRC sh
   vagrant global-status
   #+END_SRC

   #+RESULTS:
   : id       name       provider   state    directory
   : --------------------------------------------------------------------------------
   : 0f27b5d  default    virtualbox running  /Users/toby/.vagrant.d/data/docker-host
   : 194646a  db         docker     running  /Users/toby/Code/Ruby/docker-test
   : 425456d  ruby       docker     running  /Users/toby/Code/Ruby/docker-test

   Above, "default" is the name of our docker host.  With that we can
   do things like ssh into the virtual machine:

   #+BEGIN_SRC sh
   vagrant ssh 0f27b5d
   #+END_SRC

** Running Commands in the Container

   Something went wrong, I need to poke around in the Rails container:

   #+BEGIN_SRC sh
   vagrant docker-run ruby -t -- /bin/bash
   #+END_SRC

   Start a rails console in the container:

   #+BEGIN_SRC sh
   vagrant docker-run ruby -t -- rails console
   #+END_SRC

** I've Made Changes…

   Reload the container:

   #+BEGIN_SRC sh
   vagrant reload ruby
   #+END_SRC

** Logs

   All logs:

   #+BEGIN_SRC sh
   vagrant docker-logs
   #+END_SRC

   =tail= just the rails logs:

   #+BEGIN_SRC sh
   vagrant docker-logs ruby --follow
   #+END_SRC

* TODO Deploying the Container

* Resources

[1] [[www.vagrantup.com][Vagrant]]

[2] [[http://www.docker.com][Docker]]

[3] [[https://github.com/mitchellh/vagrant/issues/3728][Vagrant, boot2docker, and port-forwarding]]

  * [[https://gist.github.com/audionerd/d7d77d9af080a7a87d9b][How to get around it]]

[4] [[http://boot2docker.io][boot2docker]]

  * [[http://www.maori.geek.nz/post/vagrant_with_docker_how_to_set_up_postgres_elasticsearch_and_redis_on_mac_os_x][Vagrant with Docker: How to set up Postgres, Elasticsearch and Redis on Mac OS X]]
  * [[https://github.com/seapy/dockerfiles/blob/master/rails-nginx-unicorn/Dockerfile][Another example]]
